"""
action_list.py
穆德临时动作列表
2020/06/29 16:50
"""

help_text = [
    "-" * 50,
    "对木魔像穆德可使用的指令有：",
    "1. 投骰",
    "格式：.<n>d<n> [+-n] [描述]",
    "例如：",
    ".1d100",
    ".2d6 挥砍",
    ".1d8 +2 挥砍",
    "目前区分大小写。",
    "2. bot 随机动作",
    "格式：.mulder 或 WoodGolemMulder 或 .穆德",
    "-" * 50
]

action_list = [
    "头上长出了一片橡树叶。",
    "头上开出了一朵小小的花。",
    "泡了一壶茶。",
    "歪了歪头。",
    "慢悠悠地比划着。",
    "毫发无伤，连顶在头上的叶子都没有掉一片。",
    "泡茶所用的材料越来越奇怪，大概是被伊斯哪里做坏了吧？",
    "不能给你更多的细节——它毕竟只是个魔像。",
    "不知道被白鸦做了什么手脚，一动不动。",
    "安安静静地躺在那里，看起来就像是一根木头。",
    "已经太长时间没有出现了。",
    "有着一张忧郁面孔。",
    "慢吞吞地跟上来。",
    "从庭院里慢吞吞地踱出来，手里还握着一把小小的花铲。",
    "塞给你一杯冒着花香的热茶。",
    "开始慢吞吞地挥舞自己的手臂。",
    "从背后猛地推了你一把。",
    "在哪儿？",
    "还会泡茶，做饭，修剪花草，打扫房间……",
    "不过是个魔像，失去了赋予它力量的人……它就只是一段木头。",
    "缓缓站直身体，却只是歪了歪头。",
    "慢吞吞地把它的木头面孔转向你，右臂僵硬地扭动了几下。",
    "有很多地方与它的创造者十分相似，比如，总是不紧不慢的动作，天塌下来也能毫不在意的淡定，不管别人说什么、做什么，永远都按着自己的节奏行事……但老法师有一个动作，是穆德不会做的。",
    "“看”着你。",
    "缓缓摊开双手，做出了一个无可奈何的姿势。",
    "着一张没有眼睛的，近乎长方形的面孔。",
    "站在门口，阳光照进山谷，照亮随风摇曳的远志花花穗上晶莹的露水。",
    "像个坏掉的木偶一般被伊斯扛在肩头，长长的木腿直拖到地上。",
    "是用橡木制成的。黄白色的身体表面有着精细均匀的纹路，细长的身体和四肢在怪异中显出奇特的优雅。长脸上简单地刻出了五官，头上还顶着一根细枝，挑出几片深绿的橡树叶。",
    "并没有出手攻击，只是对着你低下头，似乎也在打量着你——尽管它根本没有眼睛。",
    "看起来几乎像是拥有自己的灵魂。",
    "缓缓向你做了个邀请的手势，转身走向山谷的深处。"
]
